c5/src/Catalogs/Employees/Employees.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Employees</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contractor</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>EmployeeType</name>
    <type>
      <types>EnumRef.EmployeeTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>HourlyCost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HourlyRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Employees/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FormGetProcessing ( FormType, Parameters, SelectedForm, AdditionalInformation, StandardProcessing )
	
	if ( FormType = "ObjectForm" ) then
		if ( individualAllowed ( Parameters ) ) then
			StandardProcessing = false;
			openIndividual ( Parameters, SelectedForm );
		endif; 
	endif; 
	
EndProcedure

Function individualAllowed ( Params )
	
	if ( Params.Property ( "IsFolder" )
		and Params.IsFolder ) then
		return false;
	endif; 
	if ( not AccessRight ( "View", Metadata.Catalogs.Individuals ) ) then
		return false;
	endif; 
	return true;

EndFunction 

Procedure openIndividual ( Params, SelectedForm )
	
	employee = undefined;
	copy = undefined;
	if ( Params.Property ( "Key", employee ) ) then
		individual = DF.Pick ( employee, "Individual" );
		Params.Insert ( "Key", individual );
		Params.Insert ( "Employee", employee );
	endif; 
	if ( Params.Property ( "CopyingValue", copy ) ) then
		Params.Insert ( "Copy", copy );
	endif; 
	Params.Insert ( "Redirected", true );
	SelectedForm = Metadata.Catalogs.Individuals.Forms.Form;

EndProcedure 

Procedure Update ( Object, Individual ) export
	
	FillPropertyValues ( Object, Individual, "Description, Email, FirstName, HomePhone, FirstName, LastName, MobilePhone, Patronymic, Gender, Web" );
	
EndProcedure 

#endif
